# Easy Guide Use SQLite database with Pandas

In [18]:
#import libraries
import sqlite3 as db
import pandas as pd
from sqlite3 import Error

# Create a SQL connection to our SQLite database

In [19]:
#connect to database or create if doesn't exist
conn = db.connect('my_database.db')
#create cursor
c = conn.cursor()

# Create table

In [20]:
#create table called 'employees'
c.execute("CREATE TABLE employees (empid INTEGER PRIMARY KEY, firstname NVARCHAR(20), lastname NVARCHAR(20))")

In [21]:
#check that table was successfully created in database
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(c.fetchall())

[('employees',)]

# Insert data into table

## Option 1 - insert a few rows

In [22]:
c.execute("INSERT INTO employees VALUES (12985,'Michael','Scott')")
c.execute("INSERT INTO employees VALUES (12986,'Dwight', 'Schrute')")

In [23]:
#check data in table
c.execute("SELECT * FROM employees;")
print(c.fetchall())

[(12985, 'Michael', 'Scott'), (12986, 'Dwight', 'Schrute')]

## Option 2 - insert many rows

In [24]:
new_employees = [(12987, 'Jim', 'Halpert'),
 (12988, 'Pam', 'Beesly'),
 (12989, 'Andy', 'Bernard'),
 (12990, 'Kevin', 'Malone'),
 (12991, 'Toby', 'Flenderson'),
 (12992, 'Angela', 'Martin'),
 (12993, 'Stanley', 'Hudson')]

In [25]:
c.executemany('INSERT INTO employees VALUES (?, ?, ?)', new_employees)

In [26]:
#check data in table
c.execute("SELECT * FROM employees;")
print(c.fetchall())

[(12985, 'Michael', 'Scott'), (12986, 'Dwight', 'Schrute'), (12987, 'Jim', 'Halpert'), (12988, 'Pam', 'Beesly'), (12989, 'Andy', 'Bernard'), (12990, 'Kevin', 'Malone'), (12991, 'Toby', 'Flenderson'), (12992, 'Angela', 'Martin'), (12993, 'Stanley', 'Hudson')]

In [27]:
#Commit changes
conn.commit()

# Connect SQLite via Pandas

In [28]:
#Establish connection
con = db.connect('my_database.db')

In [29]:
#Perform SQL query and return pandas data frame
df_employees = pd.read_sql_query ('select * from employees', con)
df_employees

   empid firstname    lastname
0  12985   Michael       Scott
1  12986    Dwight     Schrute
2  12987       Jim     Halpert
3  12988       Pam      Beesly
4  12989      Andy     Bernard
5  12990     Kevin      Malone
6  12991      Toby  Flenderson
7  12992    Angela      Martin
8  12993   Stanley      Hudson

In [30]:
#remove Stanley from employee table
df_new = df_employees[:-1]
df_new

   empid firstname    lastname
0  12985   Michael       Scott
1  12986    Dwight     Schrute
2  12987       Jim     Halpert
3  12988       Pam      Beesly
4  12989      Andy     Bernard
5  12990     Kevin      Malone
6  12991      Toby  Flenderson
7  12992    Angela      Martin

In [31]:
#Write the new dataframe to SQLite and replace employee table
df_new.to_sql("employees", con, if_exists="replace")

In [32]:
#Check table in SQLite
pd.read_sql_query ('select * from employees', con)

   index  empid firstname    lastname
0      0  12985   Michael       Scott
1      1  12986    Dwight     Schrute
2      2  12987       Jim     Halpert
3      3  12988       Pam      Beesly
4      4  12989      Andy     Bernard
5      5  12990     Kevin      Malone
6      6  12991      Toby  Flenderson
7      7  12992    Angela      Martin

In [38]:
df1=pd.read_sql_query ('select * from employees', con)

In [39]:
# pretty much similar to WHERE query in sql
firsname_test=df1[df1.firstname=='Jim']

In [40]:
print(firsname_test)

   index  empid firstname lastname
2      2  12987       Jim  Halpert

# Close connection

In [16]:
con.close()

### Extra tips
### read csv inside sqlite database

In [17]:
df=pd.read_csv("csvfile_path")
df.to_sql(table_name,conn, if_exists='append', index=False)

FileNotFoundError: [Errno 2] File csvfile_path does not exist: 'csvfile_path'